# StirrupTieAttachment Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShape..::..StirrupTieAttachment Property
RebarShape Class See Also
---
The attachment type of stirrup ties and rebars.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public StirrupTieAttachmentType StirrupTieAttachment { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StirrupTieAttachment As StirrupTieAttachmentType
	Get
```

Visual C++
---
```text
public:
property StirrupTieAttachmentType StirrupTieAttachment {
	StirrupTieAttachmentType get ();
}
```

# See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace